<!-- Pull Request 작성 유의 사항 안내
Pull Request 작성자는 리뷰어가 코드 맥락을 전혀 모른다고 가정하고
무엇을 위해서 어떤 작업을 했고 어떻게 해결하였는지 알 수 있도록 작성해주세요

 ** 너무 많은 코드를 업로드 할 경우 리뷰 시간이 길어져 작업이 지체될 수 있습니다. -->

## 이슈 번호
> 해당 PR과 관련된 이슈번호가 있다면 추가해주세요. 예) closes #이슈번호 <br>

---
## 작업 개요
> 무슨 문제를 해결하기 위해서 어떤 작업을 했는지 간단하게 작성해주세요. <br>

---
## 어떻게 해결했는가?
> 문제를 해결하기 위해 어떤 고민을 했고 어떤 방법을 택했는지 구체적으로 작성해주세요. <br>
> 해결 과정에서 겪었던 어려운점이 있었다면 어떻게 해결하였는지도 함께 작성해주세요.

---
## 작업 체크 리스트
> 작업에 필요한 어떤 요구사항을 충족해야 했는지 체크리스트를 작성해주세요. <br>
> 예시 : - [ ] 폼 입력 유효성 검사 추가.

---

## 관련 이미지 (선택)
> UI 작업이 있다면 해당 화면의 이미지를 첨부해 주세요. <br>

---

## 전달사항 (선택)
> 팀원의 도움이 필요하거나 전달하고 싶은 내용이 있다면 자유롭게 작성해주세요. <br>

---

## PR전 체크 리스트

- [ ] main 브랜치가 아닌 기능별로 필요한 브랜치에서 작업했다.
- [ ] 충돌을 방지하기 위해 가장 최신 브랜치를 merge/rebase 했다.
- [ ] 구현한 기능이 정상적으로 작동하였는지 테스트 했다.
- [ ] 코드에 불필요한 console.log 나 주석이 남아있지 않다.
- [ ] 팀내 컨벤션을 지키며 변수명과 함수명을 명시적으로 작성하였다.
- [ ] 적절한 Label과 Assignee를 설정하였다. (선택) 
- [ ] 테스트 코드가 필요한 경우 작성하고 수동 테스트를 완료했다. (선택)




